# 01. Analysis Seoul CCTV
## 1. 데이터 읽기

In [1]:
import pandas as pd

In [6]:
CCTV_Seoul = pd.read_csv("../data/01. Seoul_CCTV.csv", encoding = 'utf-8') #.. 상위폴더로 이동해라

In [7]:
CCTV_Seoul.head(10)
#CCTV_Seoul.tail()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613
5  광진구   878        573     78     53    174
6  구로구  1884       1142    173    246    323
7  금천구  1348        674     51    269    354
8  노원구  1566        542     57    451    516
9  도봉구   825        238    159     42    386

In [8]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [10]:
CCTV_Seoul.columns[0]

'기관명'

In [18]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace=True) #inplace : 바꿀래? 
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [22]:
pop_Seoul = pd.read_excel('../data/01. Seoul_Population.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017,합계,4220082,10124579,4957857,5166722,9857426,4830206,5027220,267153,127651,139502,2.34,1365126
3,2017,종로구,73594,164257,80094,84163,154770,75967,78803,9487,4127,5360,2.1,26182
4,2017,중구,60412,134593,66337,68256,125709,62253,63456,8884,4084,4800,2.08,21384

In [23]:
pop_Seoul = pd.read_excel('../data/01. Seoul_Population.xls', header=2, usecols="B,D,G,J,N")
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [24]:
pop_Seoul.rename(columns={
    pop_Seoul.columns[0]: '구별',
    pop_Seoul.columns[1]: '인구수',
    pop_Seoul.columns[2]: '한국인',
    pop_Seoul.columns[3]: '외국인',
    pop_Seoul.columns[4]: '고령자'
}, inplace=True)
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

## 2. Pandas 기초 

### Series
 - index 와 value 로 이뤄짐
 - 한가지 데이터 타입만 가질 수 있음

In [25]:
import pandas as pd
import numpy as np

In [28]:
pd.Series([1,2,3,4], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [30]:
pd.Series([1,2,3,4], dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [33]:
pd.Series(np.array([1,2,3,4]))

0    1
1    2
2    3
3    4
dtype: int32

In [34]:
pd.Series({"Key":"Value"})

Key    Value
dtype: object

In [39]:
data=pd.Series([1,2,3,4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [40]:
data % 2

0    1
1    0
2    1
3    0
dtype: int64

날짜데이터

In [56]:
dates=pd.date_range("20210101", periods=6)

### DataFrame
- pd.Sereies()
  - index, value
- pd.DataFrame()
  - index, value, column

In [57]:
# 표준정규분포에서 샘플링한 난수 생성
data = np.random.randn(6,4)
data

array([[-0.17040387,  1.47934682,  1.34163969, -1.22653244],
       [-1.19939453,  0.5437085 ,  1.83958507,  0.33267228],
       [-0.7321787 ,  0.52952119,  0.09386913, -1.23848419],
       [-0.76896883, -0.21537476, -1.4397154 , -0.67910381],
       [-1.00078757,  0.23697388, -0.76541332, -0.37850336],
       [-0.38719878,  0.56104632, -0.35402374, -0.38464665]])

In [60]:
df=pd.DataFrame(data, index= dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2021-01-01 -0.170404  1.479347  1.341640 -1.226532
2021-01-02 -1.199395  0.543709  1.839585  0.332672
2021-01-03 -0.732179  0.529521  0.093869 -1.238484
2021-01-04 -0.768969 -0.215375 -1.439715 -0.679104
2021-01-05 -1.000788  0.236974 -0.765413 -0.378503
2021-01-06 -0.387199  0.561046 -0.354024 -0.384647

#### 정보 탐색하기

In [61]:
df.head()  #df.tail()

                   A         B         C         D
2021-01-01 -0.170404  1.479347  1.341640 -1.226532
2021-01-02 -1.199395  0.543709  1.839585  0.332672
2021-01-03 -0.732179  0.529521  0.093869 -1.238484
2021-01-04 -0.768969 -0.215375 -1.439715 -0.679104
2021-01-05 -1.000788  0.236974 -0.765413 -0.378503

In [64]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [65]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [66]:
df.values

array([[-0.17040387,  1.47934682,  1.34163969, -1.22653244],
       [-1.19939453,  0.5437085 ,  1.83958507,  0.33267228],
       [-0.7321787 ,  0.52952119,  0.09386913, -1.23848419],
       [-0.76896883, -0.21537476, -1.4397154 , -0.67910381],
       [-1.00078757,  0.23697388, -0.76541332, -0.37850336],
       [-0.38719878,  0.56104632, -0.35402374, -0.38464665]])

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [68]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.709822  0.522537  0.119324 -0.595766
std    0.380368  0.555612  1.256298  0.595260
min   -1.199395 -0.215375 -1.439715 -1.238484
25%   -0.942833  0.310111 -0.662566 -1.089675
50%   -0.750574  0.536615 -0.130077 -0.531875
75%   -0.473444  0.556712  1.029697 -0.380039
max   -0.170404  1.479347  1.839585  0.332672

### 데이터 정렬
 - sort_values()
 - 특정 컬럼(열)을 기준으로 정렬합니다.

In [71]:
df.sort_values(by="B", ascending=False) #inplace = True (적용할래? 그래!)

                   A         B         C         D
2021-01-01 -0.170404  1.479347  1.341640 -1.226532
2021-01-06 -0.387199  0.561046 -0.354024 -0.384647
2021-01-02 -1.199395  0.543709  1.839585  0.332672
2021-01-03 -0.732179  0.529521  0.093869 -1.238484
2021-01-05 -1.000788  0.236974 -0.765413 -0.378503
2021-01-04 -0.768969 -0.215375 -1.439715 -0.679104

In [72]:
df["A"]

2021-01-01   -0.170404
2021-01-02   -1.199395
2021-01-03   -0.732179
2021-01-04   -0.768969
2021-01-05   -1.000788
2021-01-06   -0.387199
Freq: D, Name: A, dtype: float64

In [73]:
type(df["A"])

pandas.core.series.Series

In [74]:
# 두 개 이상 컬럼 선택
df[["A","B"]]

                   A         B
2021-01-01 -0.170404  1.479347
2021-01-02 -1.199395  0.543709
2021-01-03 -0.732179  0.529521
2021-01-04 -0.768969 -0.215375
2021-01-05 -1.000788  0.236974
2021-01-06 -0.387199  0.561046

### offset index
 - [n:m] : n부터 m-1까지
 - 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함합니다.

In [76]:
df

                   A         B         C         D
2021-01-01 -0.170404  1.479347  1.341640 -1.226532
2021-01-02 -1.199395  0.543709  1.839585  0.332672
2021-01-03 -0.732179  0.529521  0.093869 -1.238484
2021-01-04 -0.768969 -0.215375 -1.439715 -0.679104
2021-01-05 -1.000788  0.236974 -0.765413 -0.378503
2021-01-06 -0.387199  0.561046 -0.354024 -0.384647

In [77]:
df[0:3]

                   A         B         C         D
2021-01-01 -0.170404  1.479347  1.341640 -1.226532
2021-01-02 -1.199395  0.543709  1.839585  0.332672
2021-01-03 -0.732179  0.529521  0.093869 -1.238484

In [79]:
df["20210103":"20210105"]

                   A         B         C         D
2021-01-03 -0.732179  0.529521  0.093869 -1.238484
2021-01-04 -0.768969 -0.215375 -1.439715 -0.679104
2021-01-05 -1.000788  0.236974 -0.765413 -0.378503

- loc : location
- index 이름으로 특정 행, 열을 선택합니다